src/InformationRegisters/СобытияКОбработкеАктовРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияКОбработкеАктовРассмотренияВозврата</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийКОбработкеПроцессаВозвратов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СобытияКОбработкеАктовРассмотренияВозврата/Ext/ManagerModule.bsl
Процедура Добавить(АктРассмотренияВозврата, Событие, ИсточникСобытия = Неопределено) Экспорт
	
	МЗ 							= РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.СоздатьМенеджерЗаписи();
	МЗ.Период 					= ТекущаяДата();
	МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	МЗ.Событие 					= Событие;
	МЗ.ИсточникСобытия 			= ИсточникСобытия;
	МЗ.Записать();	
	
КонецПроцедуры
